fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Договоры</name>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>РеализацияПоДоговору</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьМассовоеСозданиеАктов(Период, Знач Договоры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
	|	ЗаказПокупателя.Ссылка КАК ЗаказПокупателя,
	|	РеализацияТоваровУслуг.Ссылка КАК СсылкаРеализация,
	|	ЗаказПокупателя.Дата КАК Дата
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|			ПО (РеализацияТоваровУслуг.Основание = ЗаказПокупателя.Ссылка)
	|		ПО ВКМ_ОбслуживаниеКлиента.Договор = ЗаказПокупателя.Договор
	|			И (МЕСЯЦ(ВКМ_ОбслуживаниеКлиента.Дата) = МЕСЯЦ(ЗаказПокупателя.Дата))
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);

	Выборка =  Запрос.Выполнить().Выбрать();
  	ДоговорыТЧ = Договоры;
	
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = ДоговорыТЧ.Добавить();
		СтрокаТЧ.ДоговорКонтрагента = Выборка.Договор;
		СтрокаТЧ.РеализацияПоДоговору = Выборка.СсылкаРеализация;
		Если Не ЗначениеЗаполнено(СтрокаТЧ.РеализацияПоДоговору) Тогда 
			Если Не ЗначениеЗаполнено(Выборка.ЗаказПокупателя) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("За этот период нет заказов покупателя по договору %1, документ ""Реализация товаров и услуг"" не создан", Выборка.Договор);
				Сообщение.Сообщить(); 
			Иначе
				НоваяРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
				НоваяРеализация.Дата = Выборка.Дата;
				НоваяРеализация.Договор = Выборка.Договор;
				НоваяРеализация.Заполнить(Выборка.ЗаказПокупателя);
				НоваяРеализация.ВыполнитьАвтозаполнение();
				НоваяРеализация.ПроверитьЗаполнение();
				НоваяРеализация.Записать();
				СтрокаТЧ.РеализацияПоДоговору = НоваяРеализация.Ссылка;
				НоваяРеализация.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
